import React, { useContext, useEffect, useState } from 'react';
import { useNavigate } from 'react-router-dom';

import styled from 'styled-components';

import arrow from '../../assets/icons/left-arrow 1.svg';
import Box from '@mui/material/Box';
import { $api } from '../../services/api';
import { CircularProgress, Stack } from '@mui/material';
import { localeContext } from '../../providers/LocaleProvider';
import Loader from "../../components/Loader/Loader"

const datsa = [
  {
    id: 1,
    titleKk: "1. Жалпы ережелер",
    titleRu: "1. Общие положения",
    bodyRu: `
    1.1. ТОО «Мой Тумар», «БИН 180440022535», (далее-Компания) публикует данное пользовательское соглашение (далее – Соглашение) об условиях пользования юридическими и физическими лицами (далее – Пользователь) принадлежащим Компании программным обеспечением «Кебек» (далее – ПО Кебек). <br/>
    <br/>
    1.2. Обратиться к ПО Кебек можно по адресу: Республика Казахстан, г. Нур-Султан, Мангилик Ел 55/15, block С2.3, Expo-2017, рабочий телефон: 8-700-100-75-60. <br/>
    <br/>
    1.3. В соответствии со статьей 387 Гражданского Кодекса Республики Казахстан (ГК РК) данное Соглашение является публичным договором и в случае полного принятия Пользователем изложенных в нем условий любым из перечисленных ниже способов Пользователь обязуется выполнять условия этого Соглашения. <br/>
    <br/>
    1.4. Начиная использовать какой-либо сервис ПО Кебек, либо пройдя процедуру регистрации, Пользователь считается принявшим условия Соглашения в полном объеме, без всяких оговорок и исключений. В случае несогласия Пользователя с какими-либо из положений настоящего Соглашения, Пользователь не в праве использовать сервисы ПО Кебек. <br/>
    <br/>
    1.5. Пользователь, зарегистрировавшийся на ПО Кебек, не имеет право передавать свое право пользования ПО Кебек другим юридическим и физическим лицам без официального согласования Компании. <br/>
    <br/>
    1.6. Компания имеет право прекратить оказание услуг на ПО Кебек, если Пользователь нарушил условий настоящего Соглашения или действующего законодательства Республики Казахстан в части, касающейся настоящего Соглашения. <br/>
    <br/>
    1.7. Компания меет право переместить, завершить или продлить срок действия своих услуг Пользователю по техническим причинам, находящимся под контролем или вне контроля Компании. <br/>
    <br/>
    1.8. Пользователь имеет право обратиться за защитой своих нарушенных прав и законных интересов в процессе получения услуг ПО Кебек в соответствии с действующим законодательством Республики Казахстан. <br/>
    `,
    bodyKk: `
      1.1. «Мой Тумар» ЖШС, «БСН 180440022535», (бұдан әрі – Компания) Компанияға тиесілі «Кебек» бағдарламалық жасақтамасын (бұдан әрі – Кебек БЖ) заңды және жеке тұлғалардың (бұдан әрі – Пайдаланушы) пайдалану шарттары туралы осы пайдаланушы келісімін (бұдан әрі – Келісім) жариялайды. <br/> 
      <br/>
      1.2. Кебек БЖ-ға мына мекенжай бойынша хабарласуға болады: Қазақстан Республикасы, Нұр-Сұлтан қ., Мәңгілік Ел 55/15, С2.3 блогы, Expo-2017, жұмыс телефоны: 8-700-100-75-60. <br/>
      <br/>
      1.3. Қазақстан Республикасы Азаматтық кодексінің (ҚР АК) 387-бабына сәйкес осы Келісім жария шарт болып табылады және Пайдаланушы онда жазылған талаптарды төменде санамаланған тәсілдердің кез келгенін толық қабылдаған жағдайда, Пайдаланушы осы Келісімнің талаптарын орындауға міндеттенеді. <br/>
      <br/>
      1.4. Кебек БЖ-ны қандай да болмасын қызметін қолдана бастағанда немесе тіркеу рәсіменен өте отырып, Пайдаланушы келісім талаптарын толық көлемде, ешқандай ескертулерсіз және ерекшеліктерсіз қабылдады деп саналады. Пайдаланушы осы Келісімнің қандай да бір ережесімен келіспеген жағдайда, Пайдаланушы Кебек БЖ сервистерін пайдалануға құқылы емес.<br/>
      <br/>
      1.5. Кебек БЖ-да тіркелген Пайдаланушының Кебек БЖ пайдалану құқығын Компанияның ресми келісімінсіз басқа заңды және жеке тұлғаларға беруге құқығы жоқ.<br/>
      <br/>
      1.6. Егер Пайдаланушы осы Келісімнің немесе осы Келісімге қатысты бөлігінде Қазақстан Республикасының қолданыстағы заңнамасының талаптарыан бұзса, компания Кебек БЖ-да қызмет көрсетуді тоқтатуға құқылы. <br/>
      <br/>
      1.7. Компания өзінің бақылауындағы немесе бақылауынан тыс техникалық себептер бойынша Пайдаланушыға өз қызметтерінің қолданылу мерзімін ауыстыру, аяқтау немесе ұзарту құқығын иеленеді.<br/>
      <br/>
      1.8. Пайдаланушы Қазақстан Республикасының қолданыстағы заңнамасына сәйкес Кебек БЖ қызметтерін алу процесінде өзінің бұзылған құқықтары мен заңды мүдделерін қорғау үшін жүгінуге құқылы.<br/>
      `
  },
  {
    id: 2,
    titleKk: "2. Кебек БЖ-да қолданылатын терминдердің мағыналары",
    titleRu: "2. Значения используемых в ПО Кебек терминов",
    bodyRu: `
    2.1. Программное обеспечение – программа, предназначенная для выполнения определённых задач и рассчитанная на непосредственное взаимодействие с пользователем. <br/>
    <br/>
    2.2. Пользователь - любое дееспособное физическое или юридическое лицо, принявшее условия данного Соглашения и пользующееся услугами Компании на основе ПО Кебек. <br/>
    <br/>
    2.3. Учетная запись/аккаунт – электронный кабинет Пользователя в ПО Кебек, с помощью которого он может осуществлять публикации (посты, комментарии, объявления), а также совершать иные действия, включая, но не ограничиваясь, реагирование на посты и комментарии путем проставления лайков, размещение фото и видео материалов, внесение и просматривание иных данных. <br/>
    <br/>
    2.4. Услуги - любые платные и бесплатные сервисы, оказываемые Компанией на основе ПО Кебек. <br/>
    <br/>
    2.5. Товар - любой материальный и нематериальный объект. <br/>
    <br/>
    2.6. Регистрация – принятие Пользователем данного Соглашения и процедура, в ходе которой Пользователь посредством заполнения соответствующих форм ПО Кебек предоставляет необходимую информацию для использования сервисов ПО Кебек. Регистрация считается завершенной только в случае успешного прохождения всех ее этапов в соответствии с имеющимися на ПО Тумар инструкциями. <br/>
    <br/>
    2.7. Персональные данные - сведения или совокупность сведений о юридическом или физическом лице, которое при их помощи идентифицировано или может быть конкретно идентифицировано. <br/>
    <br/>
    2.8. SMS-верификация - проверка Пользователя, которая осуществляется путем ввода в соответствующее поле на странице верификации специального кода верификации, присланного Компанией в SMS-сообщении на номер, указанный Пользователем на странице верификации. <br/>
    `,
    bodyKk: `
    2.1. Бағдарламалық жасақтама – белгілі бір тапсырмаларды орындауға арналған және пайдаланушымен тікелей іс-қимылға арналған бағдарлама. <br/>
    <br/>
    2.2. Пайдаланушы – осы Келісімнің талаптарын қабылдаған және Кебек БЖ негізінде Компанияның қызметтерін пайдаланатын кез келген әрекетке қабілетті жеке немесе заңды тұлға. <br/>
    <br/>
    2.3. Есептік жазба/аккаунт – Кебек БЖ-дағы Пайдаланушының электрондық кабинеті, оның көмегімен Пайдаланушы жарияланымдарды (жазбалар, түсініктемелер, хабарландырулар) жүзеге асыра алады, сондай-ақ лайк басу, фото және бейне материалдарды орналастыру, өзге де деректерді енгізу және қарау арқылы жазбалар мен түсініктемелерге ден қоюды, қоса алғанда, бірақ олармен шектелмей, өзге де әрекеттерді жасай алады. <br/>
    <br/>
    2.4. Қызметтер – Кебек БЖ негізінде Компания көрсететін кез келген ақылы және ақысыз қызметтер. <br/>
    <br/>
    2.5. Тауар – кез келген материалдық және материалдық емес объект. <br/>
    <br/>
    2.6. Тіркеу – Пайдаланушының осы Келісімді қабылдауы және оның барысында пайдаланушы Кебек БЖ тиісті нысандарды толтыру арқылы Кебек БЖ сервистерін пайдалану үшін қажетті ақпаратты ұсынатын рәсім. Тіркеу Тұмар БЖ-да бар нұсқаулықтарға сәйкес оның барлық кезеңдерінен сәтті өткен жағдайда ғана аяқталды деп есептеледі. <br/>
    <br/>
    <2.7. Дербес деректер – олардың көмегімен сәйкестендірілген немесе нақты сәйкестендірілуі мүмкін заңды немесе жеке тұлға туралы мәліметтер немесе мәліметтер жиынтығы. <br/>
    <br/>
    2.8. SMS-верификациялау – Пайдаланушы верификациялау бетінде көрсеткен нөміріге Компания жіберген SMS-хабарламада верификацияның арнайы кодын верификациялау бетіндегі тиісті жолға енгізу арқылы жүзеге асырылатын Пайдаланушыны тексеру. <br/>
    `
  },
  {
    id: 3,
    titleKk: "3. Пайдаланушыны Тұмар БЖ-да тіркеу тәртібі",
    titleRu: "3. Порядок регистрации Пользователя на ПО Тумар",
    bodyRu: `
    3.1. Принятие условий и заключение данного Соглашения Пользователем проводится в форме регистрации посредством заполнения соответствующих форм в функциональной системе ПО Кебек, в ходе которой Пользователь предоставляет необходимую информацию для использования сервисов ПО Кебек. Регистрация считается завершенной только в случае успешного прохождения всех ее этапов в соответствии с опубликованными на ПО Кебек инструкциями. <br/>
    <br/>
    3.2. В ходе регистрации Пользователь обязан предоставить свои персональные данные в объеме достаточном для его конкретной идентификации. <br/>
    <br/>
    3.3. Проверка Пользователя (SMS-верификация) осуществляется путем ввода в соответствующее поле на странице верификации специального кода верификации, присланного Компанией в SMS-сообщении на номер, указанный Пользователем на странице верификации. <br/>
    <br/>
    3.4. Пользователь обязан немедленно изменить данные для входа на ПО Кебек, если у него есть причины подозревать, что используемые для этого электронный адрес и пароль были раскрыты или могут быть использованы третьими лицами. <br/>
    `,
    bodyKk: `
    3.1. Пайдаланушының осы Келісімді жасасуы және оның талаптарын қабылдауы Кебек БЖ функционалдық жүйесінде тиісті нысандарды толтыру арқылы тіркеу нысанында жүргізіледі, оның барысында Пайдаланушы Кебек БЖ сервистерін пайдалану үшін қажетті ақпаратты ұсынады. Тіркеу Кебек БЖ-да жарияланған нұсқаулықтарға сәйкес оның барлық кезеңдерінен сәтті өткен жағдайда ғана аяқталды деп есептеледі. <br/>
    <br/>
    3.2. Тіркеу барысында Пайдаланушы өзінің дербес деректерін оны нақты сәйкестендіру үшін жеткілікті көлемде ұсынуға міндетті. <br/>
    <br/>
    3.3. Пайдаланушыны тексеру (SMS-верификация) Пайдаланушы верификациялау бетінде көрсеткен нөміріге Компания жіберген SMS-хабарламада верификацияның арнайы кодын верификациялау бетіндегі тиісті жолға енгізу арқылы жүзеге асырылады. <br/>
    <br/>
    3.4. Пайдаланушы, егер ол үшін пайдаланылатын электрондық пошта мекенжайы мен құпиясөз ашылған немесе олардың үшінші тұлғалардың пайдалануы мүмкін деп күдіктенуге себептері болса, Кебек БЖ-ға кіруге арналған деректерді дереу өзгертуге міндетті. <br/>
    `
  },
  {
    id: 4,
    titleKk: "4. Пайдаланушылардың дербес деректерін өңдеу шарттары",
    titleRu: "4. Условия обработки персональных данных Пользователей",
    bodyRu: `
    4.1. При регистрации и использовании ПО Кебек Пользователи предоставляют Компании право на обработку их персональных данных. Компания обязуется принимать все необходимые меры по сохранению их конфиденциальности и использовании исключительно в интересах Пользователя. <br/>
    <br/>
    4.2. Компания сохраняет за собой право связываться с Пользователем, направлять информационные сообщения на электронный и физический адрес, указанный при регистрации, а также отправлять сообщения на мобильный телефон Пользователя. <br/>
    <br/>
    4.3. Компания сохраняет данные последнего доступа на ПО Кебек Пользователя с целью обеспечения высокого качества предоставляемых сервисов, приспосабливаемых к индивидуальным потребностям и интересам Пользователя, а также для сбора статистической информации об использовании услуг Пользователями. <br/>
    <br/>
    4.4. Опросы, проводимые время от времени Компанией могут содержать вопросы о демографических данных Пользователей (например, образование, возраст, доход). Данные, собираемые Компанией с помощью таких опросов, обрабатываются в обезличенном виде. Пользователи имеют возможность не принимать участие в опросах и отказаться от предоставления информации. Компания использует демографические данные, в целях составления статистических отчетов и улучшения качества услуг. <br/>
    `,
    bodyKk: `
    4.1. Кебек БЖ-да тіркелу және оны пайдалану кезінде Пайдаланушылар Компанияға өздерінің дербес деректерін өңдеу құқығын береді. Компания олардың құпиялылығын сақтау және тек Пайдаланушының мүддесі үшін пайдалану бойынша барлық қажетті шараларды қабылдауға міндеттенеді. <br/>
    <br/>
    4.2. Компания Пайдаланушымен байланысу, ақпараттық хабарламаларды тіркеу кезінде көрсетілген электрондық және нақты мекенжайға жолдау, сондай-ақ Пайдаланушының ұялы телефонына хабарламалар жіберу құқығын өзінде сақтайды. <br/>
    <br/>
    4.3. Компания Пайдаланушының жеке қажеттіліктері мен мүдделеріне бейімделетін ұсынылатын сервистердің жоғары сапасын қамтамасыз ету мақсатында, сондай-ақ Пайдаланушылардың қызметтерді пайдалануы туралы статистикалық ақпаратты жинау үшін Пайдаланушының Кебегі БЖ-ға соңғы кіру деректерін сақтайды. <br/>
    <br/>
    4.4. Компания ауық-ауық жүргізетін сауалнамалар Пайдаланушылардың демографиялық деректері (мысалы, білімі, жасы, табысы) туралы сұрақтарды қамтуы мүмкін. Осындай сауалнамалар арқылы Компания жинайтын деректер иесіздендірілген түрде өңделеді. Пайдаланушылардың сауалнамаларға қатыспау және ақпарат беруден бас тарту мүмкіндігі бар. Компания статистикалық есептерді жасау және қызметтерді көрсету сапасын жақсарту мақсатында демографиялық деректерді пайдаланады. <br/>
    `
  },
  {
    id: 5,
    titleKk: "5. Пайдаланушының құқықтары мен міндеттері",
    titleRu: "5. Права и обязанности Пользователя",
    bodyRu: `
    5.1. Пользователь обязуется: <br/>
    <br/>
    5.1.1. не предпринимать никаких действий, которые могут привести к непропорционально большой нагрузке на инфраструктуру ПО Кебек; <br/>
    <br/>
    5.1.2. не использовать автоматические программы для получения доступа на ПО Кебек без письменного разрешения Компании; <br/>
    <br/>
    5.1.3. не препятствовать и не пытаться препятствовать работе и другой деятельности на ПО Кебек; а также не препятствовать действию автоматических систем или процессов, а также других мероприятий, с целью воспрепятствовать или ограничить доступ на ПО Кебек <br/>
    <br/>
    5.2. Пользователю запрещается: <br/>
    обсуждение действий модераторов и администрации сайта иным образом, кроме как посредством электронной переписки с модераторами; <br/>
    использование имен Пользователей, похожих на имена других Пользователей, с целью выдать за них себя и писать сообщения от их имени.
    `,
    bodyKk: `
    5.1. Пайдаланушы: <br/>
    <br/>
    5.1.1. Кебек БЖ инфрақұрылымына пропорционалды емес үлкен жүктемеге әкелуі мүмкін ешқандай іс-қимылдарды қабылдамауға; <br/>
    <br/>
    5.1.2. Компанияның жазбаша рұқсатынсыз Кебек БЖ-ға қол жеткізу үшін автоматты бағдарламаларды пайдаланбауға; <br/>
    <br/>
    5.1.3. Кебек БЖ жұмысына және басқа да қызметіне кедергі келтірмеуге және кедергі жасауға тырыспауға; сондай-ақ Кебек БЖ-ға қолжетімділікке бөгет жасау немесе оны шектеу мақсатында автоматты жүйелердің немесе процестердің, сондай-ақ басқа да іс-шаралардың әсеріне кедергі келтірмеуге міндеттенеді. <br/>
    <br/>
    5.2. Пайдаланушыға: <br/>
    модераторлармен электронды хат алмасудан басқа өзгеше түрде модераторлар мен сайт әкімшілігінің іс-әрекеттерін талқылауға; <br/>
    өздерін солар етіп көрсету және олардың атынан хабарлама жазу мақсатында басқа Пайдаланушылардың аттарына ұқсас Пайдаланушылардың аттарын пайдалануға тыйым салынады. <br/>
    <br/>
    5.3. Пайдаланушы Кебек БЖ жұмысы мәселелері бойынша шағымдар жіберуге құқылы, олар келіп түскен сәттен бастап немесе шағымның мәні бойынша толық ақпарат алған сәттен бастап екі жұмыс күні ішінде қаралатын болады. Компания өз қалауы бойынша шағымды қарауды тоқтатуға және/немесе Келісім талаптарын бұзған Пайдаланушыларға жауаптардың санын шектеуге құқылы. <br/>
    <br/>
    5.3. Пользователь вправе направлять жалобы по вопросам работы ПО Кебек, которые будут рассмотрены в течение двух рабочих дней с момента их поступления или с момента получения полной информации по сути жалобы. Компания имеет право по своему усмотрению прекратить рассмотрение жалобы, и/или ограничить количество ответов Пользователям, нарушающим условия Соглашения.
    `
  },
  {
    id: 6,
    titleKk: "6. Компанияның құқықтары мен міндеттері",
    titleRu: "6. Права и обязанности Компании",
    bodyRu: `
    6.1. Чтобы поддерживать высокое качество своих услуг, Компания оставляет за собой право ограничить количество активных действий Пользователя на ПО Кебек. <br/>
    <br/>
    6.2. Компания может запретить Пользователю доступ на ПО Кебек, если Пользователь нарушает условия настоящего Соглашения. Факт нарушения считается подтвержденным, если Пользователь был оповещен администрацией ПО Кебек о ведении деятельности, нарушающей правила ПО Кебек и прав третьих лиц. <br/>
    <br/>
    6.3. Компания оставляет за собой право в любой момент удалить или отключить учетную запись Пользователя, оставив предварительное уведомление Пользователю о таком отключении на свое усмотрение, и не неся при этом ответственность за свои действия перед Пользователем и третьими лицами. <br/>
    <br/>
    6.4. Оператор Компании, предоставляющий поддержку Пользователей по телефону, и/или отвечающий на телефонный звонок Пользователя, имеет право прекратить звонок в случае угроз Пользователя в сторону оператора или Компании, нецензурной лексики, перевод разговора на личные темы, беспредметности разговора. <br/>
    <br/>
    6.5. Компания вправе передать ПО Кебек со всеми его сервисами и содержанием, включая личную информацию Пользователей, своему правопреемнику по договорам или иным основаниям. Передача и уведомление Пользователей о такой передаче осуществляется в соответствии с требованиями действующего законодательства Республики Казахстан. <br/> 
    <br/>
    6.6. Компания оставляет за собой право в любой момент потребовать от Пользователя подтверждения данных, указанных им при регистрации, и запросить в связи с этим подтверждающие документы (в частности – копии/заверенные копии документов, удостоверяющих личность), не предоставление которых, по усмотрению Пользователя, может быть приравнено к предоставлению недостоверной информации. В случае если данные Пользователя, указанные в предоставленных им документах, не соответствуют данным, указанным при регистрации, или в случаях, когда данные, указанные при регистрации, не позволяют идентифицировать Пользователя, Компания вправе отказать Пользователю в доступе к использованию сервисов ПО Кебек с предварительным уведомлением Пользователя или без такового. <br/>
    <br/>
    6.7. Компания не несет ответственности за любой несанкционированный доступ или использование серверов Компании и/или любой хранящейся на них информации о пользователях, а также за любые ошибки, вирусы, «троянские кони» и т.д., которые могут быть переданы на сайт или через сайт третьими лицами. <br/>
    <br/>
    6.8. Бездействие со стороны Компании в случае нарушения Пользователем положений Соглашения не лишает Компанию права предпринять соответствующие действия в защиту своих интересов позднее, а также не означает отказа Компании от своих прав в случае совершения в последующем подобных либо сходных нарушений. <br/>
    <br/>
    6.9. Компания не несет ответственности за неисполнение или затруднения в исполнении обязательств по предоставлению доступа к ПО Кебек из-за непредвиденных обстоятельств непреодолимой силы, последствий которых невозможно избежать или преодолеть (таких как решения властей, трудовые споры, несчастные случаи, обрывы в общей системе коммуникаций и т.д.). <br/>
    <br/>
    6.10. Компания не несет ответственности за неполадки в работе ПО Кебек, вызванные техническими перебоями в работе оборудования и программного обеспечения. <br/>
    `,
    bodyKk: `
    6.1. Компания өз қызметтерінің жоғары сапасын қолдау үшін Пайдаланушының Кебек  БЖ-дағы белсенді әрекеттерінің санын шектеу құқығын өзіне қалдырады. <br/>
    <br/>
    6.2. Егер Пайдаланушы осы Келісімнің таоаптарын бұзса, Компания Пайдаланушыға Кебек БЖ-ға кіруге тыйым салуы мүмкін. Егер Пайдаланушыны Кебек БЖ әкімшілігі Кебек БЖ қағидаларын және үшінші тұлғалардың құқықтарын бұзатын қызметтің жүргізілгені туралы хабардар етсе, бұзушылық фактісі расталды. <br/>
    <br/>
    6.3. Компания Пайдаланушыға өзінің қалауы бойынша мұндай өшіру туралы алдын ала хабарлама қалдыра отырып және бұл ретте Пайдаланушы мен үшінші тұлғалардың алдында өз іс-әрекеттері үшін жауапкершілікте болмай, Пайдаланушының есептік жазбасын кез келген сәтте жою немесе өшіру құқығын өзіне қалдырады. <br/>
    <br/>
    6.4. Телефон арқылы Пайдаланушыларға қолдау көрсететін және/немесе Пайдаланушының телефон қоңырауына жауап беретін Компания операторы Пайдаланушы оператор немесе Компания жағына қауіп төндіру, балағат сөздер айту, әңгімені жеке тақырыптарға ауыстыру, сөйлесудің мағынасыздығы жағдайында қоңырауды тоқтатуға құқылы. <br/>
    <br/>
    6.5. Компания Кебек БЖ-ны оның барлық қызметтерімен және мазмұнымен бірге, соның ішінде Пайдаланушылардың жеке ақпаратын, шарттар немесе өзге де негіздер бойынша өзінің құқықтық мирасқорына беруге құқылы. Беру және Пайдаланушыларды осындай беру туралы хабардар ету Қазақстан Республикасының қолданыстағы заңнамасының талаптарына сәйкес жүзеге асырылады. <br/>
    <br/>
    6.6. Компания кез келген сәтте Пайдаланушыдан ол тіркеу кезінде көрсеткен деректердің расталуын талап етуге және осыған байланысты растаушы құжаттарды (атап айтқанда – жеке басты куәландыратын құжаттардың көшірмелерін/куәландырылған көшірмелерін) сұратуға құқылы, Пайдаланушының қалауы бойынша олардың ұсынылмауы, күмәнді ақпаратты ұсынуға теңестірілуі мүмкін. Егер Пайдаланушының өзі ұсынған құжаттарда көрсетілген деректері тіркеу кезінде көрсетілген деректерге сәйкес келмеген жағдайда немесе тіркеу кезінде көрсетілген деректер Пайдаланушыны сәйкестендіруге мүмкіндік бермеген жағдайларда Компания Пайдаланушыға алдын ала хабарлай отырып немесе онсыз Пайдаланушының Кебек БЖ сервистерін пайдалануға қолжетімділігін тоқтатуға құқылы. <br/>
    <br/>
    6.7. Компания өзінің серверлеріне және/немесе оларда сақталатын пайдаланушылар туралы кез келген ақпаратқа рұқсат етілмеген қол жеткізу немесе пайдалану үшін, сондай-ақ сайтқа немесе үшінші тұлғалардың сайт арқылы беруі мүмкін кез келген қателер, вирустар, «трояндық аттар» және т.б. үшін жауапты болмайды. <br/>
    <br/>
    6.8. Пайдаланушы Келісім ережелерін бұзған жағдайда Компания тарапынан әрекетсіздік Компанияны өз мүдделерін қорғау үшін тиісті әрекеттерді кешірек қолдану құқығынан айырмайды, сондай-ақ кейіннен осындай немесе ұқсас бұзушылықтар жасалған жағдайда Компанияның өз құқықтарынан бас тартуын білдірмейді. <br/>
    <br/>
    6.9. Компания салдарларын болдырмау немесе еңсеру мүмкін емес күтпеген еңсерілмейтін күш мән-жайлары (биліктің шешімдері, еңбек даулары, жазатайым оқиғалар, коммуникациялардың жалпы жүйесіндегі үзілістер және т.б.) салдарынан Кебек БЖ-ға қолжетімділікті ұсыну бойынша міндеттемелерді орындамағаны немесе орындаудағы қиындықтар үшін жауапты болмайды. <br/>
    <br/>
    6.10. Компания жабдықтар мен бағдарламалық жасақтаманың жұмысындағы техникалық іркілістерден туындаған Кебектер БЖ-ның жұмысындағы ақаулар үшін жауапты болмайды. <br/>
    `
  },
  {
    id: 7,
    titleKk: "7. Келісімнің қолданылу мерзімі және сайт қызметтерін көрсетуді тоқтату",
    titleRu: "7. Срок действия Соглашения и прекращение оказания услуг сайта",
    bodyRu: `
    7.1. Настоящее Соглашение вступает в силу с момента начала использования Пользователем какого-либо сервиса ПО Тумар либо с момента регистрации Пользователя на сайте и действует бессрочно. <br/>
    <br/>
    7.2. Пользователь имеет право прекратить свою регистрацию на ПО Тумар в одностороннем порядке, предварительно уведомив об этом Компанию с объяснением причин. <br/>
    <br/>
    7.3. В случае если Компанией были внесены какие-либо изменения в Соглашение, с которыми Пользователь не согласен, он обязан прекратить использование сервисов ПО Тумар. Факт не прекращения использования ПО Тумар является подтверждением согласия Пользователя с измененной редакцией Соглашения. <br/>
    `,
    bodyKk: `
    7.1. Осы Келісім Пайдаланушы Тұмар БЖ қандай да бір сервисін пайдалана бастаған сәттен бастап немесе Пайдаланушы сайтта тіркелген сәттен бастап күшіне енеді және мерзімсіз қолданылады. <br/>
    <br/>
    7.1. Осы Келісім Пайдаланушы Тұмар БЖ қандай да бір сервисін пайдалана бастаған сәттен бастап немесе Пайдаланушы сайтта тіркелген сәттен бастап күшіне енеді және мерзімсіз қолданылады. <br/>
    <br/>
    7.3. Егер Компания Келісімге Пайдаланушы келіспейтін қандай да бір өзгерістерді енгізген жағдайда, ол Тұмар БЖ сервистерін пайдалануды тоқтатуға міндетті. Тұмар БЖ пайдалануды тоқтатпау фактісі Пайдаланушының Келісімнің өзгертілген редакциясыне келіскенін растау болып табылады. <br/>
    `
  },
  {
    id: 8,
    titleKk: "8. Өзге де шарттар",
    titleRu: "8. Прочие условия",
    bodyRu: `
    8.1. В случае если Компанией были внесены какие-либо изменения в Соглашение, с которыми Пользователь не согласен, он обязан прекратить использование сервисов ПО Кебек. Факт не прекращения использования ПО Кебек является подтверждением согласия Пользователя с измененной редакцией Соглашения. <br/>
    <br/>
    9.2. Настоящее Соглашение регулируется и толкуется в соответствии с законодательством Республики Казахстан. Вопросы, не урегулированные настоящим Соглашением, подлежат разрешению в соответствии с действующим законодательством. <br/>
    <br/>
    9.3. Признание судом какого-либо положения Соглашения недействительным или не подлежащим принудительному исполнению не влечет недействительности или неисполнимости иных положений данного Соглашения.  <br/>
    `,
    bodyKk: `
    8.1. Егер Компания Келісімге Пайдаланушы келіспейтін қандай да бір өзгерістерді енгізген жағдайда, ол Кебек БЖ сервистерін пайдалануды тоқтатуға міндетті. Кебек БЖ пайдалануды тоқтатпау фактісі Пайдаланушының Келісімнің өзгертілген редакциясыне келіскенін растау болып табылады. <br/> 
    <br/>
    9.2. Осы Келісім Қазақстан Республикасының заңнамасына сәйкес реттеледі және түсіндіріледі. Осы Келісіммен реттелмеген мәселелер қолданыстағы заңнамаға сәйкес шешілуге тиіс. <br/>
    <br/>
    9.3. Келісімнің қандай да бір ережесін соттың жарамсыз немесе мәжбүрлеп орындатуға жатпайды деп тануы осы Келісімнің өзге ережелерінің жарамсыздығына немесе орындалмауына әкеп соқпайды.  <br/>
    `
  }
]

const UserAgreement = () => {
  const [data, setData] = useState([]);
  const navigate = useNavigate();
  const { locale } = useContext(localeContext);

  useEffect(() => {
    $api
      .get('/support/policies/')
      .then((res) =>
        res?.data?.results.forEach((item) =>
          setData((prev) => [...prev, ...item?.policy])
        )
      );
  }, []);

  if (data.length === 0) {
    return <Loader />
  }

  function stylesMyText(text) {
    return {
      __html: text
    }
  }

  return (
    <UserAgreementS>
      <Box
        sx={{
          display: 'flex',
          alignItems: 'center',
          cursor: 'pointer',
        }}
      >
        <ul className={"d-flex align-items-center m-0 p-0 ps-2"} style={{ listStyle: "none" }}>
          <img src={arrow} alt='' />
          <li style={{ color: "#BDBDBD", marginLeft: 5 }} onClick={() => navigate(-1)}>{locale === "ru" ? "Назад" : "Артқа"}</li>
          <li style={{ margin: '0 0 0 10px', fontWeight: 600 }}>/ {locale === "ru" ? "Пользовательское соглашение" : "Қолдану ережелері"}</li>
        </ul>
      </Box>
      <Title>{locale === "ru" ? "Пользовательское соглашение" : "Қолдану ережелері"}</Title>
      <List>
        {/* {data.map((item) => (
          <Item key={item.id}>
            <ItemTitle>{item.title}</ItemTitle>
            <ItemDescription>{item.content}</ItemDescription>
          </Item>
        ))} */}

        {datsa.map((item) => (
          <Item key={item.id}>
            <ItemTitle>{locale === "ru" ? item.titleRu : item.titleKk}</ItemTitle>
            {/* <ItemDescription >{item.body}</ItemDescription> */}
            <p style={{ fontSize: 18, color: "#6b7280" }} dangerouslySetInnerHTML={stylesMyText(locale === "ru" ? item.bodyRu : item.bodyKk)} ></p>
          </Item>
        ))}
      </List>
    </UserAgreementS>
  );
};

const StackS = styled(Stack)`
  min-height: 73vh;
  width: 100%;
  display: flex;
  justify-content: center;
  align-items: center;
`;

const UserAgreementS = styled.div`
  min-height: 73vh;
`;
const Title = styled.h1`
  font-family: Rubik, sans-serif;
  font-size: 35px;
  line-height: 140%;
  color: #092f33;
  font-weight: 600;
  margin: 30px 0;
`;
const List = styled.ul`
  margin: 0 !important;
  padding: 0 !important;
  max-width: 900px;
`;
const Item = styled.div`
  margin-bottom: 50px;
`;
const ItemTitle = styled.h4`
  font-family: Rubik, sans-serif;
  font-size: 25px;
  line-height: 140%;
  color: #092f33;
  font-weight: 600;
  margin-bottom: 30px;
`;
const ItemDescription = styled(ItemTitle)`
  font-weight: 300;
  font-size: 16px;
  font-size: 18px;
  color: #6b7280;
  margin-bottom: 30px;
`;

export default UserAgreement;
