import React, { useContext, useEffect, useState } from 'react';
import { useNavigate } from 'react-router-dom';

import styled from 'styled-components';

import arrow from '../../assets/icons/left-arrow 1.svg';
import Box from '@mui/material/Box';
import { $api } from '../../services/api';
import { CircularProgress, Stack } from '@mui/material';
import { localeContext } from '../../providers/LocaleProvider';
import Loader from "../../components/Loader/Loader"

const datsa = [
    {
        id: 1,
        titleRu: "1. Общие положения",
        titleKk: "1. Жалпы ережелер",
        bodyKk: `
        Осы дербес деректерді өңдеу саясаты «Дербес деректер және оларды қорғау туралы» 2013 жылғы 21 мамырдағы № 94-V Қазақстан Республикасы Заңының (бұдан әрі - Дербес деректер туралы заң) талаптарына сәйкес жасалған және дербес деректерді өңдеу тәртібін және "Мой Тумар" ЖШС (бұдан әрі – Оператор) қабылдайтын дербес деректердің қауіпсіздігін қамтамасыз ету жөніндегі шараларды айқындайды. <br/>
        <br/>
        1.1. Оператор өзінің қызметін жүзеге асырудың маңызды мақсаты мен шарты ретінде адамның және азаматтың дербес деректерін өңдеу кезінде оның құқықтары мен бостандықтарын сақтауды, оның ішінде жеке өміріне қол сұғылмаушылық, жеке және отбасылық құпия құқықтарын қорғауды қояды. <br/>
        <br/>
        1.2. Осы Оператордың дербес деректерді өңдеуге қатысты саясаты (бұдан әрі – Саясат) Оператор Кебек мобильді қолданбасын (бұдан әрі - БЖ) пайдаланушылар туралы ала алатын барлық ақпаратқа қолданылады. <br/>
        `,
        bodyRu: `
        Настоящая политика обработки персональных данных составлена в соответствии с требованиями закона Республики Казахстан от 21 мая 2013 года № 94-V «О персональных данных и их защите» (далее - Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые ТОО "Мой Тумар" (далее – Оператор). <br/>
        <br/>
        1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну. <br/>
        <br/>
        1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну. может получить о пользователях мобильного приложения Кебек (далее - ПO). <br/>
        `
    },
    {
        id: 2,
        titleRu: "2. Основные понятия, используемые в Политике",
        titleKk: "2. Саясатта қолданылатын негізгі ұғымдар",
        bodyKk: `
        2.1. Дербес деректерді автоматтандырылған өңдеу – есептеу техникасы құралдарының көмегімен дербес деректерді өңдеу. <br/>
        <br/>
        2.2. Дербес деректерді бұғаттау – дербес деректерді өңдеуді уақытша тоқтату (дербес деректерді нақтылау үшін өңдеу қажет болатын жағдайларды қоспағанда). <br/>
        <br/>
        2.3. Дербес деректердің ақпараттық жүйесі – деректер базасында қамтылған дербес деректердің және оларды өңдеуді қамтамасыз ететін ақпараттық технологиялар мен техникалық құралдардың жиынтығы. <br/>
        <br/>
        2.4. Дербес деректерді иесіздендіру – нәтижесінде қосымша ақпаратты пайдаланбай дербес деректердің нақты Пайдаланушыға немесе дербес деректердің өзге субъектісіне тиесілігін анықтау мүмкін болмайтын іс-әрекеттер. <br/>
        <br/>
        2.5. Дербес деректерді өңдеу – дербес деректерді жинауды, жазуды, жүйелеуді, жинақтауды, сақтауды, нақтылауды (жаңартуды, өзгертуді), алуды, пайдалануды, беруді (таратуды, ұсынуды, қол жеткізуді), иесіздендіруді, бұғаттауды, жоюды, құртуды қоса алғанда, автоматтандыру құралдарын пайдалана отырып немесе осындай құралдарды пайдаланбай дербес деректермен жасалатын кез келген іс-әрекет (операция) немесе іс-әрекеттер (операциялар) жиынтығы. <br/>
        <br/>
        2.6. Оператор – дербес немесе басқа тұлғалармен бірлесіп дербес деректерді өңдеуді ұйымдастыратын және (немесе) жүзеге асыратын, сондай-ақ дербес деректерді өңдеу мақсаттарын, өңделетін дербес деректердің құрамын, дербес деректермен жасалатын әрекеттерді (операцияларды) айқындайтын мемлекеттік орган, муниципалдық орган, заңды немесе жеке тұлға. <br/>
        <br/>
        2.7. Дербес деректер – Қолданбаның белгілі немесе анықталып жатқан Пайдаланушысына тікелей немесе жанама қатысты кез келген ақпарат. <br/>
        <br/>
        2.8. Дербес деректер субъектісі тарату үшін рұқсат берген дербес деректер - Дербес деректер туралы заңда көзделген тәртіппен тарату үшін дербес деректер субъектісі рұқсат берген дербес деректерді өңдеуге келісім беру арқылы дербес деректер субъектісі шектеусіз тұлғалар тобының қол жеткізуі берілген дербес деректер (бұдан әрі - тарату үшін рұқсат етілген дербес деректер). <br/>
        <br/>
        2.9. Пайдаланушы – БЖ-ның кез келген пайдаланушысы. <br/>
        <br/>
        2.10. Дербес деректерді беру – белгілі бір тұлғаға немесе белгілі бір тұлғалар тобына дербес деректерді ашуға бағытталған іс-әрекеттер. <br/>
        <br/>
        2.11. Дербес деректерді тарату – дербес деректерді анықталмаған тұлғалар тобына ашуға (дербес деректерді беруге) немесе шектелмеген тұлғалар тобының дербес деректерімен танысуға, оның ішінде дербес деректерді бұқаралық ақпарат құралдарында жариялауға, ақпараттық-телекоммуникациялық желілерде орналастыруға немесе дербес деректерге қандай да бір өзге тәсілмен қол жеткізу мүмкіндігін беруге бағытталған кез келген іс-әрекеттер. <br/>
        <br/>
        2.12. Дербес деректерді трансшекаралық беру – дербес деректерді шет мемлекеттің аумағына шет мемлекеттің билік органына, шетелдік жеке немесе шетелдік заңды тұлғаға беру. <br/>
        <br/>
        2.13. Дербес деректерді жою – нәтижесінде дербес деректердің ақпараттық жүйесіндегі дербес деректердің мазмұнын одан әрі қалпына келтіру мүмкін болмайтындай етіп, дербес деректер біржола жойылатын және (немесе) дербес деректердің материалдық тасығыштары жойылатын кез келген іс-әрекеттер. <br/>
        `,
        bodyRu: `
        2.1. Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники. <br/>
        <br/>
        2.2. Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных). <br/>
        <br/>
        2.3. Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств. <br/>
        <br/>
        2.4. Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных. <br/>
        <br/>
        2.5. Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных. <br/>
        <br/>
        2.6. Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными. <br/>
        <br/>
        2.7. Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю Приложения. <br/>
        <br/>
        2.8. Персональные данные, разрешенные субъектом персональных данных для распространения, - персональные данные, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных путем дачи согласия на обработку персональных данных, разрешенных субъектом персональных данных для распространения в порядке, предусмотренном Законом о персональных данных (далее - персональные данные, разрешенные для распространения). <br/>
        <br/>
        2.9. Пользователь – любой пользователь ПО. <br/>
        <br/>
        2.10. Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц. <br/>
        <br/>
        2.11. Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом. <br/>
        <br/>
        2.12. Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу. <br/>
        <br/>
        2.13. Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) уничтожаются материальные носители персональных данных. <br/>
        `
    },
    {
        id: 3,
        titleRu: "3. Основные права и обязанности Оператора",
        titleKk: "3. Оператордың негізгі құқықтары мен міндеттері",
        bodyKk: `
        3.1. Оператордың құқықтары: <br/>
        – дербес деректер субъектісінен дербес деректерді қамтитын дәйектіақпаратты және/немесе құжаттарды алу; <br/>
        – дербес деректер субъектісі дербес деректерді өңдеуге келісімін қайтарып алған жағдайда, Оператор Дербес деректер туралы заңда көрсетілген негіздер болған кезде дербес деректер субъектісінің келісімінсіз дербес деректерді өңдеуді жалғастыруға құқылы; <br/>
        – Дербес деректер туралы заңда немесе басқа заңдарда өзгеше көзделмесе, Дербес деректер туралы заңда және оған сәйкес қабылданған нормативтік құқықтық актілерде көзделген міндеттердің орындалуын қамтамасыз ету үшін қажетті және жеткілікті шаралардың құрамы мен тізбесін дербес айқындау. <br/>
        <br/>
        3.2. Оператордың міндеттері: <br/>
        – дербес деректер субъектісіне оның өтініші бойынша оның дербес деректерін өңдеуге қатысты ақпарат беру; <br/>
        – ҚР қолданыстағы заңнамасымен белгіленген тәртіпте дербес деректерді өңдеуді ұйымдастыру; <br/>
        – Дербес деректер туралы заңның талаптарына сәйкес дербес деректер субъектілерінің және олардың заңды өкілдерінің өтініштері мен сұрау салуларына жауап беру; <br/>
        – дербес деректер субъектілерінің құқықтарын қорғау жөніндегі уәкілетті органға осы органның сұрау салуы бойынша қажетті ақпаратты осындай сұрау салуды алған күннен бастап 30 күн ішінде хабарлау; <br/>
        – дербес деректерді өңдеуге қатысты осы Саясатты жариялау немесе басқаша түрде шектеусіз қолжетімділікті қамтамасыз ету; <br/>
        – дербес деректерді оларға заңсыз немесе кездейсоқ қол жеткізуден, дербес деректерді жоюдан, өзгертуден, бұғаттаудан, көшіруден, беруден, таратудан, сондай-ақ дербес деректерге қатысты өзге де заңсыз әрекеттерден қорғау үшін құқықтық, ұйымдастырушылық және техникалық шараларды қабылдау; <br/>
        – Дербес деректер туралы заңда көзделген тәртіппен және жағдайларда дербес деректерді беруді (таратуды, ұсынуды, қол жеткізуді) тоқтату, дербес деректерді өңдеуді тоқтату және оларды жою; <br/>
        – Дербес деректер туралы заңда көзделген өзге де міндеттерді орындау. <br/>
        `,
        bodyRu: `
        3.1. Оператор имеет право: <br/>
        – получать от субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные; <br/>
        – в случае отзыва субъектом персональных данных согласия на обработку персональных данных Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в Законе о персональных данных; <br/>
        – самостоятельно определять состав и перечень мер, необходимых и достаточных для обеспечения выполнения обязанностей, предусмотренных Законом о персональных данных и принятыми в соответствии с ним нормативными правовыми актами, если иное не предусмотрено Законом о персональных данных или другими законами. <br/>
        <br/>
        3.2. Оператор обязан: <br/>
        – предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его персональных данных; <br/>
        – организовывать обработку персональных данных в порядке, установленном действующим законодательством РК; <br/>
        – организовывать обработку персональных данных в порядке, установленном действующим законодательством РК; <br/>
        – сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу этого органа необходимую информацию в течение 30 дней с даты получения такого запроса; <br/>
        – публиковать или иным образом обеспечивать неограниченный доступ к настоящей Политике в отношении обработки персональных данных; <br/>
        – принимать правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных; <br/>
        – прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных данных; <br/>
        – исполнять иные обязанности, предусмотренные Законом о персональных данных. <br/>
        `
    },
    {
        id: 4,
        titleKk: "4. Дербес деректер субъектілерінің негізгі құқықтары мен міндеттері",
        titleRu: "4. Основные права и обязанности субъектов персональных данных",
        bodyKk: `
        4.1. Дербес деректер субъектілерінің құқықтары: <br/>
        – Қазақстан Республикасының заңдарында көзделген жағдайларды қоспағанда, оның дербес деректерін өңдеуге қатысты ақпарат алу. Оператор дербес деректер субъектісіне мәліметтерді қолжетімді нысанда береді және мұндай дербес деректерді ашу үшін заңды негіздер болған жағдайларды қоспағанда, оларда дербес деректердің басқа субъектілеріне қатысты дербес деректер болмауға тиіс. Ақпараттың тізбесі және оны алу тәртібі Дербес деректер туралы заңда белгіленген; <br/>
        – егер дербес деректер толық емес, ескірген, дәл емес, заңсыз алынған болса немесе мәлімделген өңдеу мақсаты үшін қажетті болып табылмаса, Оператордан оның дербес деректерін нақтылауды, оларды бұғаттауды немесе жоюды талап ету, сондай-ақ өз құқықтарын қорғау жөнінде заңда көзделген шараларды қолдану; <br/>
        – нарықта тауарларды, жұмыстар мен қызметтерді жылжыту мақсатында дербес деректерді өңдеу кезінде алдын ала келісім шартын ұсыну; <br/>
        – дербес деректерді өңдеуге келісімді кері қайтарып алу; <br/>
        – дербес деректер субъектілерінің құқықтарын қорғау жөніндегі уәкілетті органға немесе оператордың дербес деректерін өңдеу кезіндегі заңсыз іс-әрекеттеріне немесе әрекетсіздігіне сот тәртібімен шағымдану; <br/>
        – ҚР заңнамасында көзделген өзге де құқықтарды жүзеге асыруға құқығы бар. <br/>
        <br/>
        4.2. Дербес деректер субъектілерінің міндеттері: <br/>
        – Операторға өзі туралы шынайы деректерді ұсыну; <br/>
        – Операторға өзінің дербес деректерін нақтылау (жаңарту, өзгерту) туралы хабарлау. <br/>
        <br/>
        4.3. Операторға өзі туралы немесе басқа дербес деректер субъектісі туралы мәліметтерді соңғысының келісімінсіз берген тұлғалар Қазақстан Республикасының заңнамасына сәйкес жауапты болады.
        `,
        bodyRu: `
        4.1. Субъекты персональных данных имеют право: <br/>
        – получать информацию, касающуюся обработки его персональных данных, за исключением случаев, предусмотренных законами РК. Сведения предоставляются субъекту персональных данных Оператором в доступной форме, и в них не должны содержаться персональные данные, относящиеся к другим субъектам персональных данных, за исключением случаев, когда имеются законные основания для раскрытия таких персональных данных. Перечень информации и порядок ее получения установлен Законом о персональных данных; <br/>
        – требовать от оператора уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав; <br/>
        – выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на рынке товаров, работ и услуг; <br/>
        – на отзыв согласия на обработку персональных данных; <br/>
        – обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных; <br/>
        – на осуществление иных прав, предусмотренных законодательством РК. <br/>
        <br/>
        4.2. Субъекты персональных данных обязаны: <br/>
        – предоставлять Оператору достоверные данные о себе; <br/>
        – сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных. <br/>
        <br/>
        4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом субъекте персональных данных без согласия последнего, несут ответственность в соответствии с законодательством РК. <br/>
        `
    },
    {
        id: 5,
        titleRu: "5. Оператор может обрабатывать следующие персональные данные Пользователя",
        titleKk: "5. Оператор Пайдаланушының келесі дербес деректерін өңдей алады",
        bodyKk: `
        5.1. Тегі, аты, әкесінің аты. <br/>
        <br/>
        5.2. Электрондық мекенжайы. <br/>
        <br/>
        5.3. Телефон нөмірлері. <br/>
        <br/>
        5.4. Фотосуреттер. <br/>
        <br/>
        5.5. Пайдаланушының әлеуметтік желіде көрсеткен аты. <br/>
        <br/>
        5.6. Сондай-ақ қолданбада интернет-статистика сервистерінің (Google Analytics for Firebase) көмегімен келушілер туралы иесіздендірілген деректерді жинау және өңдеу жүргізіледі. <br/>
        <br/>
        5.7. Саясат мәтініндегі жоғарыда аталған деректер Дербес деректер жалпы ұғымымен біріктірілген. <br/>
        <br/>
        5.8. Оператор нәсіліне, ұлтына, саяси көзқарасына, діни немесе философиялық нанымына, интимдік өміріне қатысты дербес деректердің арнайы санаттарын өңдеуді жүзеге асырмайды. <br/>
        <br/>
        5.9. Пайдаланушының таратуға рұқсат етілген дербес деректерді өңдеуге келісімі оның дербес деректерін өңдеуге арналған басқа келісімдерден бөлек ресімделеді. Бұл ретте Дербес деректер туралы заңда көзделген шарттар сақталады. Мұндай келісімнің мазмұнына қойылатын талаптарды дербес деректер субъектілерінің құқықтарын қорғау жөніндегі уәкілетті орган белгілейді. <br/>
        <br/>
        5.9.1 Таратуға рұқсат етілген дербес деректерді өңдеуге келісімді Пайдаланушы Операторға тікелей береді. <br/>
        <br/>
        5.9.2 Оператор Пайдаланушының аталған келісімін алған сәттен бастап үш жұмыс күнінен кешіктірмей өңдеу шарттары туралы, тарату үшін рұқсат етілген шектелмеген тұлғалар тобының дербес деректерді өңдеуіне тыйым салулар мен шарттардың болуы туралы ақпаратты жариялауға міндетті.
        <br/>
        <br/>
        5.9.3 Дербес деректер субъектісі тарату үшін рұқсат еткен дербес деректерді беру (тарату, беру, қол жеткізу) дербес деректер субъектісінің талабы бойынша кез келген уақытта тоқтатылуы тиіс. Бұл талап дербес деректер субъектісінің тегін, атын, әкесінің атын (бар болса), байланыс ақпаратын (телефон нөмірін, электрондық пошта мекенжайын немесе пошталық мекенжайын), сондай-ақ өңделуі тоқтатылуға жататын дербес деректердің тізбесін қамтуға тиіс. Осы талапта көрсетілген дербес деректерді ол жіберілген Оператор ғана өңдей алады.
        5.9.4 Таратуға рұқсат етілген дербес деректерді өңдеуге келісім Операторға дербес деректерді өңдеуге қатысты осы Саясаттың 5.9.3-тармағында көрсетілген талап келіп түскен сәттен бастап өз қолданысын тоқтатады. <br/>
        `,
        bodyRu: `
        5.1. Фамилия, имя, отчество. <br/> 
        <br/>
        5.2. Электронный адрес. <br/>
        <br/>
        5.3. Номера телефонов. <br/>
        <br/>
        5.4. Фотографии. <br/>
        <br/>
        5.5. Имя, указанное пользователем в социальной сети. <br/>
        <br/>
        5.6. Также в приложении происходит сбор и обработка обезличенных данных о посетителях с помощью сервисов интернет-статистики (Google Analytics for Firebase). <br/>
        <br/>
        5.7. Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные. <br/>
        <br/>
        5.8. Обработка специальных категорий персональных данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, интимной жизни, Оператором не осуществляется. <br/>
        <br/>
        5.9. Согласие Пользователя на обработку персональных данных, разрешенных для распространения, оформляется отдельно от других согласий на обработку его персональных данных. При этом соблюдаются условия, предусмотренные, Законом о персональных данных. Требования к содержанию такого согласия устанавливаются уполномоченным органом по защите прав субъектов персональных данных. <br/>
        <br/>
        5.9.1 Согласие на обработку персональных данных, разрешенных для распространения, Пользователь предоставляет Оператору непосредственно. <br/>
        <br/>
        5.9.2 Оператор обязан в срок не позднее трех рабочих дней с момента получения указанного согласия Пользователя опубликовать информацию об условиях обработки, о наличии запретов и условий на обработку неограниченным кругом лиц персональных данных, разрешенных для распространения. <br/>
        <br/>
        5.9.3 Передача (распространение, предоставление, доступ) персональных данных, разрешенных субъектом персональных данных для распространения, должна быть прекращена в любое время по требованию субъекта персональных данных. Данное требование должно включать в себя фамилию, имя, отчество (при наличии), контактную информацию (номер телефона, адрес электронной почты или почтовый адрес) субъекта персональных данных, а также перечень персональных данных, обработка которых подлежит прекращению. Указанные в данном требовании персональные данные могут обрабатываться только Оператором, которому оно направлено. <br/>
        <br/>
        5.9.4 Согласие на обработку персональных данных, разрешенных для распространения, прекращает свое действие с момента поступления Оператору требования, указанного в п. 5.9.3 настоящей Политики в отношении обработки персональных данных. <br/>
        `
    },
    {
        id: 6,
        titleKk: "6. Дербес деректерді өңдеу принциптері",
        titleRu: "6. Принципы обработки персональных данных",
        bodyKk: `
        6.1. Дербес деректерді өңдеу заңды және әділ негізде жүзеге асырылады. <br/>
        <br/>
        6.2. Дербес деректерді өңдеу нақты, алдын ала анықталған және заңды мақсаттарға қол жеткізумен шектеледі. Дербес деректерді жинау мақсаттарына сәйкес келмейтін дербес деректерді өңдеуге жол берілмейді. <br/>
        <br/>
        6.3. Өңделуі өзара үйлеспейтін мақсаттарда жүзеге асырылатын дербес деректерді қамтитын деректер базасын біріктіруге жол берілмейді. <br/>
        <br/>
        6.4. Өңдеуге оларды өңдеу мақсаттарына жауап беретін дербес деректер ғана жатады. <br/>
        <br/>
        6.5. Өңделетін дербес деректердің мазмұны мен көлемі өңдеудің мәлімделген мақсаттарына сәйкес келеді. Өңделетін дербес деректердің көлемі оларды өңдеудің мәлімделген мақсаттарына қатысты артық болуына жол берілмейді. <br/>
        <br/>
        6.6. Дербес деректерді өңдеу кезінде дербес деректердің дәлдігі, олардың жеткіліктілігі, ал қажет болған жағдайларда дербес деректерді өңдеу мақсаттарына қатысты өзектілігі қамтамасыз етіледі. Оператор толық емес немесе дәл емес деректерді жою немесе нақтылау бойынша қажетті шаралар қабылдайды және/немесе олардың қабылдануын қамтамасыз етеді. <br/>
        <br/>
        6.7. Дербес деректерді сақтау мерзімі заңда, дербес деректер субъектісі тарапы, ол бойынша пайда алушы немесе кепіл беруші болып табылатын шартта белгіленбесе, дербес деректерді сақтау дербес деректер субъектісін айқындауға мүмкіндік беретін нысанда, дербес деректерді өңдеу мақсаттары талап еткеннен аспайтын мерзімде жүзеге асырылады. Егер заңда өзгеше көзделмесе, өңделетін дербес деректер өңдеу мақсаттарына жеткен кезде немесе осы мақсаттарға жету қажеттілігі жоғалған жағдайда жойылады немесе иесізденеді. <br/>
        `,
        bodyRu: `
        6.1. Обработка персональных данных осуществляется на законной и справедливой основе. <br/>
        <br/>
        6.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных. <br/>
        <br/>
        6.3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой. <br/>
        <br/>
        6.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки. <br/>
        <br/>
        6.5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Не допускается избыточность обрабатываемых персональных данных по отношению к заявленным целям их обработки. <br/>
        <br/>
        6.6. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных. Оператор принимает необходимые меры и/или обеспечивает их принятие по удалению или уточнению неполных или неточных данных. <br/>
        <br/>
        6.7. Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных. Обрабатываемые персональные данные уничтожаются либо обезличиваются по достижении целей обработки или в случае утраты необходимости в достижении этих целей, если иное не предусмотрено законом. <br/>
        `
    },
    {
        id: 7,
        titleRu: "7. Цели обработки персональных данных",
        titleKk: "7. Дербес деректерді өңдеу мақсаттары",
        bodyKk: `
        7.1. Пайдаланушының дербес деректерін өңдеу мақсаты: <br/>
        – Пайдаланушыға Қолданбадағы сервистерге, ақпаратқа және/немесе материалдарға рұқсат беру. <br/>
        <br/>
        7.2. Сондай-ақ, Оператор Пайдаланушыға жаңа өнімдер мен қызметтер, арнайы ұсыныстар мен түрлі оқиғалар туралы хабарлама жіберуге құқылы. Пайдаланушы «Жаңа өнімдер мен қызметтер және арнайы ұсыныстар туралы хабарламалардан бас тарту» белгісімен Операторға info@waviot.kz электрондық пошта мекенжайына хат жібере отырып, ақпараттық хабарламаларды алудан әрқашан бас тарта алады. <br/>
        <br/>
        7.3. Интернет-статистика сервистерінің көмегімен жиналған Пайдаланушылардың иесіздендірілген деректері сайттағы Пайдаланушылардың іс-әрекеттері туралы ақпарат жинауға, сайттың сапасын және оның мазмұнын жақсартуға қызмет етеді. <br/>
        `,
        bodyRu: `
        7.1. Цель обработки персональных данных Пользователя: <br/>
        – предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся в Приложении. <br/>
        <br/>
        7.2. Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес электронной почты info@waviot.kz с пометкой «Отказ от уведомлений о новых продуктах и услугах и специальных предложениях». <br/>
        <br/>
        7.3. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания. <br/>
        `
    },
    {
        id: 8,
        titleRu: "8. Правовые основания обработки персональных данных",
        titleKk: "8. Дербес деректерді өңдеудің құқықтық негіздері",
        bodyKk: `
        8.1. Оператордың дербес деректерді өңдеуінің құқықтық негіздері: <br/>
        – Оператордың жарғылық (құрылтай) құжаттары; <br/>
        – ҚР заңдары, дербес деректерді қорғау саласындағы өзге де нормативтік-құқықтық актілер; <br/>
        <br/>
        8.2. Оператор Пайдаланушының дербес деректерін оларды толтырған және/немесе Пайдаланушы Қолданбада орналасқан немесе Операторға электрондық пошта арқылы жіберілген арнайы нысандар арқылы дербес жіберген жағдайда ғана өңдейді. Тиісті нысандарды толтыра отырып және/немесе Операторға өзінің дербес деректерін жібере отырып, Пайдаланушы осы Саясатпен өзінің келісімін білдіреді. <br/>
        <br/>
        8.3. Дербес деректер субъектісі өзінің дербес деректерін беру туралы шешімді өз бетінше қабылдайды және еркін, өз еркімен және өзінің мүддесінде келісім береді. <br/>
        `,
        bodyRu: `
        8.1. Правовыми основаниями обработки персональных данных Оператором являются: <br/>
        – уставные (учредительные) документы Оператора; <br/>
        – законы РК, иные нормативно-правовые акты в сфере защиты персональных данных; <br/>
        – согласия Пользователей на обработку их персональных данных, на обработку персональных данных, разрешенных для распространения. <br/>
        <br/>
        8.2. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные в Приложении, или направленные Оператору посредством электронной почты. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой. <br/>
        <br/>
        8.3. Субъект персональных данных самостоятельно принимает решение о предоставлении его персональных данных и дает согласие свободно, своей волей и в своем интересе. <br/>
        `
    },
    {
        id: 9,
        titleRu: "9. Условия обработки персональных данных",
        titleKk: "9. Дербес деректерді өңдеу шарттары",
        bodyKk: `
        9.1. Дербес деректерді өңдеу дербес деректер субъектісінің оның дербес деректерін өңдеуге келісімімен жүзеге асырылады. <br/>
        <br/>
        9.2. Дербес деректерді өңдеу сот төрелігін жүзеге асыру, сот актісін, Қазақстан Республикасының атқарушылық іс жүргізу туралы заңнамасына сәйкес орындалуға жататын басқа органның немесе лауазымды адамның актісін орындау үшін қажет. <br/>
        <br/>
        9.4. Дербес деректерді өңдеу дербес деректер субъектісі тарапы не ол бойынша пайда алушы немесе кепіл беруші болып табылатын шартты орындау үшін, сондай-ақ дербес деректер субъектісінің бастамасы бойынша шарт немесе дербес деректер субъектісі пайда алушы немесе кепіл беруші болып табылатын шарт жасасу үшін қажет. <br/>
        <br/>
        9.5. Дербес деректерді өңдеу оператордың немесе үшінші тұлғалардың құқықтары мен заңды мүдделерін жүзеге асыру үшін не дербес деректер субъектісінің құқықтары мен бостандықтары бұзылмаған жағдайда, қоғамдық маңызы бар мақсаттарға қол жеткізу үшін қажет. <br/>
        <br/>
        9.6. Дербес деректер субъектісі ұсынған не оның өтініші бойынша шектеусіз тұлғалар тобының қолжетімділігі қамтамасыз етілген дербес деректерді (бұдан әрі – жалпыға қолжетімді дербес деректер) өңдеу жүзеге асырылады. <br/>
        <br/>
        9.7. Заңға сәйкес жариялануға немесе міндетті түрде ашылуға жататын дербес деректерді өңдеу жүзеге асырылады. <br/>
        `,
        bodyRu: `
        9.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных. <br/>
        <br/>
        9.2. Обработка персональных данных необходима для осуществления правосудия, исполнения судебного акта, акта другого органа или должностного лица, подлежащих исполнению в соответствии с законодательством Республики Казахстан об исполнительном производстве. <br/>
        <br/>
        9.4. Обработка персональных данных необходима для исполнения договора, стороной которого либо выгодоприобретателем или поручителем, по которому является субъект персональных данных, а также для заключения договора по инициативе субъекта персональных данных или договора, по которому субъект персональных данных будет являться выгодоприобретателем или поручителем.<br/>
        <br/>
        9.5. Обработка персональных данных необходима для осуществления прав и законных интересов оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и свободы субъекта персональных данных. <br/>
        <br/>
        9.6. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных либо по его просьбе (далее – общедоступные персональные данные). <br/>
        <br/>
        9.7. Осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в соответствии с законом. <br/>
        `
    },
    {
        id: 10,
        titleRu: "10. Порядок сбора, хранения, передачи и других видов обработки персональных данных",
        titleKk: "10. Дербес деректерді жинау, сақтау, беру және өңдеудің басқа да түрлерінің тәртібі",
        bodyKk: `
        Оператор өңдейтін дербес деректердің қауіпсіздігі дербес деректерді қорғау саласындағы қолданыстағы заңнаманың талаптарын толық көлемде орындау үшін қажетті құқықтық, ұйымдастырушылық және техникалық шараларды іске асыру арқылы қамтамасыз етіледі. <br/>
        <br/>
        10.1. Оператор дербес деректердің сақталуын қамтамасыз етеді және уәкілетті емес адамдардың дербес деректерге қол жеткізуіне жол бермейтін барлық ықтимал шараларды қабылдайды.<br/>
        <br/>
        10.2. Қолданыстағы заңнаманы орындаумен байланысты жағдайларды қоспағанда не егер дербес деректер субъектісі Операторға азаматтық-құқықтық шарт бойынша міндеттемелерді орындау үшін деректерді үшінші тұлғаға беруге келісім берген жағдайда, Пайдаланушының дербес деректері ешқашан, ешқандай жағдайда үшінші тұлғаларға берілмейді. <br/>
        <br/>
        10.3. Дербес деректерде дәлсіздіктер анықталған жағдайда, Пайдаланушы «Дербес деректерді өзектендіру» белгісімен Оператордың info@winext.kz электрондық пошта мекенжайына хабарлама жіберу арқылы оларды өз бетінше өзектендіре алады. <br/>
        <br/>
        10.4. Дербес деректерді өңдеу мерзімі, егер шартта немесе қолданыстағы заңнамада өзгеше мерзім көзделмесе, дербес деректер жиналған мақсаттарға қол жеткізумен айқындалады.
        Пайдаланушы кез келген сәтте Операторға «Дербес деректерді өңдеуге келісімді кері қайтарып алу» белгісімен Оператордың info@winext.kz электрондық мекенжайына электрондық пошта арқылы хабарлама жібере отырып, дербес деректерді өңдеуге өзінің келісімін қайтарып ала алады. <br/>
        <br/>
        10.5. Бөгде сервистер, оның ішінде төлем жүйелері, байланыс құралдары және басқа да қызметтерді жеткізушілер жинайтын барлық ақпаратты аталған тұлғалар (Операторлар) өздерінің Пайдаланушылық келісіміне және Құпиялылық саясатына сәйкес сақтайды және өңдейді. Дербес деректер субъектісі және/немесе Пайдаланушы көрсетілген құжаттармен өз бетінше уақтылы танысуға міндетті. Оператор үшінші тұлғалардың, оның ішінде осы тармақта көрсетілген қызметтерді жеткізушілердің іс-әрекеттері үшін жауапты болмайды. <br/>
        <br/>
        10.6. Дербес деректер субъектісі белгілеген, таратуға рұқсат етілген дербес деректерді беруге (қолжетімділікті ұсынудан басқа), сондай-ақ өңдеуге тыйым салу немесе өңдеу шарттары (қолжетімділікті алудан басқа) дербес деректерді Қазақстан Республикасының заңнамасында айқындалған мемлекеттік, қоғамдық және өзге де жария мүдделерде өңдеу жағдайларында қолданылмайды. <br/>
        <br/>
        10.7. Оператор дербес деректерді өңдеу кезінде дербес деректердің құпиялылығын қамтамасыз етеді. <br/>
        <br/>
        10.8. Оператор дербес деректерді сақтау мерзімі заңда, дербес деректер субъектісі тарапы, ол бойынша пайда алушы немесе кепіл беруші болып табылатын шартта белгіленбесе, дербес деректер субъектісін айқындауға мүмкіндік беретін нысанда дербес деректерді сақтауды дербес деректерді өңдеу мақсаттары талап еткеннен аспайтын мерзімде жүзеге асырады. <br/>
        <br/>
        10.9. Дербес деректерді өңдеуді тоқтатудың шарты дербес деректерді өңдеу мақсаттарына қол жеткізу, дербес деректер субъектісінің келісім мерзімінің аяқталуы немесе дербес деректер субъектісінің келісімді кері қайтарып алуы, сондай-ақ дербес деректерді заңсыз өңдеуді анықтау болуы мүмкін. <br/>
        `,
        bodyRu: `
        Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных. <br/>
        <br/>
        10.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц. <br/>
        <br/>
        10.2. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства либо в случае, если субъектом персональных данных дано согласие Оператору на передачу данных третьему лицу для исполнения обязательств по гражданско-правовому договору. <br/>
        <br/>
        10.3. В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора info@winext.kz с пометкой «Актуализация персональных данных». <br/>
        <br/>
        10.4. Срок обработки персональных данных определяется достижением целей, для которых были собраны персональные данные, если иной срок не предусмотрен договором или действующим законодательством.
        Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора info@winext.kz с пометкой «Отзыв согласия на обработку персональных данных».
        <br/>
        <br/>
        10.5. Вся информация, которая собирается сторонними сервисами, в том числе платежными системами, средствами связи и другими поставщиками услуг, хранится и обрабатывается указанными лицами (Операторами) в соответствии с их Пользовательским соглашением и Политикой конфиденциальности. Субъект персональных данных и/или Пользователь обязан самостоятельно своевременно ознакомиться с указанными документами. Оператор не несет ответственность за действия третьих лиц, в том числе указанных в настоящем пункте поставщиков услуг. <br/>
        <br/>
        10.6. Установленные субъектом персональных данных запреты на передачу (кроме предоставления доступа), а также на обработку или условия обработки (кроме получения доступа) персональных данных, разрешенных для распространения, не действуют в случаях обработки персональных данных в государственных, общественных и иных публичных интересах, определенных законодательством РК. <br/>
        <br/>
        10.7. Оператор при обработке персональных данных обеспечивает конфиденциальность персональных данных. <br/>
        <br/>
        10.8. Оператор осуществляет хранение персональных данных в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен законом, договором, стороной которого, выгодоприобретателем или поручителем, по которому является субъект персональных данных. <br/>
        <br/>
        10.9. Условием прекращения обработки персональных данных может являться достижение целей обработки персональных данных, истечение срока действия согласия субъекта персональных данных или отзыв согласия субъектом персональных данных, а также выявление неправомерной обработки персональных данных. <br/>
        `
    },
    {
        id: 11,
        titleRu: "11. Перечень действий, производимых Оператором с полученными персональными данными",
        titleKk: "11. Алынған дербес деректермен Оператор жүргізетін іс-қимылдар тізбесі",
        bodyKk: `
        11.1. Оператор дербес деректерді жинауды, жазуды, жүйелеуді, жинақтауды, сақтауды, нақтылауды (жаңартуды, өзгертуді), алуды, пайдалануды, беруді (таратуды, ұсынуды, қолжетімділікті), иесіздендіруді, бұғаттауды, жоюды және құртуды жүзеге асырады. <br/>
        <br/>
        11.2. Оператор ақпараттық-телекоммуникациялық желілер бойынша алынған ақпаратты алумен және/немесе берумен немесе онсыз дербес деректерді автоматтандырылған өңдеуді жүзеге асырады. <br/>
        `,
        bodyRu: `
        11.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение персональных данных. <br/>
        <br/>
        11.2. Оператор осуществляет автоматизированную обработку персональных данных с получением и/или передачей полученной информации по информационно-телекоммуникационным сетям или без таковой. <br/>
        `
    },
    {
        id: 12,
        titleRu: "12. Трансграничная передача персональных данных",
        titleKk: "12. Дербес деректерді трансшекаралық беру",
        bodyKk: `
        12.1. Оператор дербес деректерді трансшекаралық беруді жүзеге асыру басталғанға дейін аумағына дербес деректерді беруді жүзеге асыру болжанып отырған шет мемлекеттің дербес деректер субъектілерінің құқықтарын сенімді қорғауды қамтамасыз ететініне көз жеткізуге міндетті. <br/>
        <br/>
        12.2. Жоғарыда көрсетілген талаптарға жауап бермейтін шет мемлекеттердің аумағында дербес деректерді трансшекаралық беру дербес деректер субъектісінің оның дербес деректерін трансшекаралық беруге жазбаша нысанда келісімі болған және/немесе дербес деректер субъектісі тарапы болып табылатын шартты орындаған жағдайда ғана жүзеге асырылуы мүмкін. <br/>
        `,
        bodyRu: `
        12.1. Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных. <br/>
        <br/>
        12.2. Трансграничная передача персональных данных на территории иностранных государств, не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме субъекта персональных данных на трансграничную передачу его персональных данных и/или исполнения договора, стороной которого является субъект персональных данных. <br/>
        `
    },
    {
        id: 13,
        titleRu: "13. Конфиденциальность персональных данных",
        titleKk: "13. Дербес деректердің құпиялылығы",
        bodyKk: `
        Дербес деректерге қол жеткізген Оператор мен өзге де тұлғалар, егер заңнамада өзгеше көзделмесе, дербес деректер субъектісінің келісімінсіз дербес деректерді үшінші тұлғаларға ашпауға және таратпауға міндетті.
        `,
        bodyRu: `
        Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено законодательством. <br/>
        `
    },
    {
        id: 14,
        titleRu: "14. Заключительные положения",
        titleKk: "14. Қорытынды ережелер",
        bodyKk: `
        14.1. Пайдаланушы info@winext.kz электрондық поштасының көмегімен операторға хабарласып, өзінің дербес деректерін өңдеуге қатысты қызықтыратын мәселелер бойынша кез келген түсініктемені ала алады. <br/>
        <br/>
        14.2. Бұл құжатта Оператордың дербес деректерді өңдеу саясатындағы кез келген өзгерістер көрсетіледі. Саясат оны жаңа нұсқамен алмастырғанға дейін мерзімсіз әрекет етеді. <br/>
        <br/>
        14.3. Саясаттың өзекті нұсқасы Интернет желісінде мына мекенжай бойынша еркін қолжетімді:  <br/>
        `,
        bodyRu: `
        14.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты info@winext.kz. <br/>
        <br/>
        14.2. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией. <br/>
        <br/>
        14.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу <br/>
        `
    }
]

const Policy = () => {
    const [data, setData] = useState([]);
    const navigate = useNavigate();
    const { locale } = useContext(localeContext);

    useEffect(() => {
        $api
            .get('/support/policies/')
            .then((res) =>
                res?.data?.results.forEach((item) =>
                    setData((prev) => [...prev, ...item?.policy])
                )
            );
    }, []);

    if (data.length === 0)
        return <Loader />

    function stylesMyText(text) {
        return {
            __html: text
        }
    }

    return (
        <UserAgreementS>
            <Box
                sx={{
                    display: 'flex',
                    alignItems: 'center',
                    cursor: 'pointer',
                }}
            >
                <ul className={"d-flex align-items-center m-0 p-0 ps-2"} style={{ listStyle: "none" }}>
                    <img src={arrow} alt='' />
                    <li style={{ color: "#BDBDBD", marginLeft: 5 }} onClick={() => navigate(-1)}>{locale === "ru" ? "Назад" : "Артқа"}</li>
                    <li style={{ margin: '0 0 0 10px', fontWeight: 600 }}>/ {locale === "ru" ? "Политика конфиденциальности" : "Құпиялылық саясаты"}</li>
                </ul>
            </Box>
            <Title>{locale === "ru" ? "Политика конфиденциальности" : "Құпиялылық саясаты"}</Title>
            <List>
                {/* {data.map((item) => (
            <Item key={item.id}>
              <ItemTitle>{item.title}</ItemTitle>
              <ItemDescription>{item.content}</ItemDescription>
            </Item>
          ))} */}

                {datsa.map((item) => (
                    <Item key={item.id}>
                        <ItemTitle>{locale === "ru" ? item.titleRu : item.titleKk}</ItemTitle>
                        <p style={{ fontSize: 18, color: "#6b7280" }} dangerouslySetInnerHTML={stylesMyText(locale === "ru" ? item.bodyRu : item.bodyKk)} ></p>
                    </Item>
                ))}
            </List>
        </UserAgreementS>
    );
};

const StackS = styled(Stack)`
    min-height: 73vh;
    width: 100%;
    display: flex;
    justify-content: center;
    align-items: center;
  `;

const UserAgreementS = styled.div`
    min-height: 73vh;
  `;
const Title = styled.h1`
    font-family: Rubik, sans-serif;
    font-size: 35px;
    line-height: 140%;
    color: #092f33;
    font-weight: 600;
    margin: 30px 0;
  `;
const List = styled.ul`
    margin: 0 !important;
    padding: 0 !important;
    max-width: 900px;
  `;
const Item = styled.div`
    margin-bottom: 50px;
  `;
const ItemTitle = styled.h4`
    font-family: Rubik, sans-serif;
    font-size: 25px;
    line-height: 140%;
    color: #092f33;
    font-weight: 600;
    margin-bottom: 30px;
  `;
const ItemDescription = styled(ItemTitle)`
    font-weight: 300;
    font-size: 16px;
    font-size: 18px;
    color: #6b7280;
    margin-bottom: 30px;
  `;

export default Policy;